/* ****************************************************************************************************
 * 封装数据
 * 封装实现
 * 封装类型
 * 封装变化
 ************************************************************************************************* */

/**
 * 封装数据
 * 在许多面向对象的语言系统中，封装数据都是通过语法解析来实现的，这些语言也许提供了private, public, protected等关键字来提供不同的访问权限
 */

/** 利用作用域，模拟private和public */
const myPersona = (() => {
  var _name = "xiaoming";
  return {
    getName: function () {
      return _name;
    },
  };
})();

console.log(myPersona._name);
console.log(myPersona.getName());
