/**
 *
 */

/* ****************************************************************************************************
 * 动态类型语言和静态类型语言
 *
 * 动态： 运行时，待变量被赋予某个值之后，才会具有变量类型
 * 静态： 编译时就知道变量类型
 ************************************************************************************************* */

/* ****************************************************************************************************
 *    鸭子类型：如果它走起路来像鸭子，叫起来像鸭子，那它就是鸭子
 ************************************************************************************************* */

const duck = {
  duckSinging: function () {
    console.log("嘎嘎嘎");
  },
};

const chicken = {
  duckSinging: function () {
    console.log("嘎嘎嘎");
  },
};

const choir = [];
const joinChoir = function (animal) {
  if (animal && typeof animal.duckSinging === "function") {
    choir.push(animal);
    console.log("恭喜加入合唱团");
    console.log(`合唱团成员当前数量：${choir.length}`);
  }
};
joinChoir(duck);
joinChoir(chicken);
